## Extra Exercises 1

In [2]:
import numpy as np
import pandas as pd

</br>

#### 1. Combine multiple series to form a DataFrame

In [3]:
series1 = pd.Series(list('abcedfghijklmnopqrstuvwxyz'))
series2 = pd.Series(np.arange(26))

In [10]:
#Answer:
df = pd.DataFrame(zip(series1, series2))
df.head()

   0  1
0  a  0
1  b  1
2  c  2
3  e  3
4  d  4

**Extra**: Create a third series and combine the three. What happens if one series is a different length?

In [11]:
series3 = pd.Series(np.arange(20))
df1 = pd.DataFrame(zip(df, series3))

df1.head()

   0  1
0  0  0
1  1  1

</br>

#### 2. Keep only top 2 most frequent values as it is and replace everything else as 'Other'

In [13]:
np.random.seed(42)
series = pd.Series(np.random.randint(1, 5, [12]))

print(series)

0     3
1     4
2     1
3     3
4     3
5     4
6     1
7     1
8     3
9     2
10    3
11    3
dtype: int64

In [14]:
#Answer:

pd.value_counts(series)

3    6
1    3
4    2
2    1
Name: count, dtype: int64

**Extra**: Do the same but for the highest and lowest value count, replacing everything else as other.

</br>

#### 3. Extract items at given positions from a series

In [8]:
series = pd.Series(list('abcdefghijklmnopqrstuvwxyz'))
positions = [0, 4, 8, 14, 20]

In [ ]:
#Answer:

</br>

#### 4. Compute differences between consecutive numbers of a series

**Desired Output**: [nan, 2.0, 3.0, 4.0, 5.0, 6.0, 6.0, 8.0]

In [ ]:
series = pd.Series([1, 3, 6, 10, 15, 21, 27, 35])

In [11]:
#Answer:

**Extra**: Find the cumulative sum of the series instead of the differences. </br>
**Desired Output**: [1, 4, 10, 20, 35, 56, 83, 118]

</br>

#### 5. String Manipulation

Have the user enter a string and write a function that capitalizes the first letter of each word.

In [20]:
#Answer:

**Extra**: Print out the count of the number of words in the string.

</br>

#### 6. Extracting Data

In [34]:
data = [
    {
        "id": 1,
        "name": "John",
        "department": ["HR", "New York"],
        "skills": ["communication", "teamwork", "leadership"]
    },
    {
        "id": 2,
        "name": "Jane",
        "department": ["Finance", "San Francisco"],
        "skills": ["accounting", "analysis"]
    },
    {
        "id": 3,
        "name": "Michael",
        "department": ["Engineering", "Seattle"],
        "skills": ["programming", "problem-solving"]
    },
    {
        "id": 4,
        "name": "Sarah",
        "department": ["Marketing", "Los Angeles"],
        "skills": ["marketing", "creativity"]
    },
    {
        "id": 5,
        "name": "David",
        "department": ["Sales", "Chicago"],
        "skills": ["sales", "negotiation"]
    },
    {
        "id": 6,
        "name": "Emily",
        "department": ["Engineering", "Seattle"],
        "skills": ["coding", "troubleshooting"]
    }
]

##### A. Extract all employee names

In [33]:
#Answer: using list comprehension
res = [ sub['name'] for sub in data ]

#Answer: using list comprehension and get() method
#This approach also considers the case where the key does not exists.
res1 = [sub.get('name', None) for sub in data]



print('res: ',res)
print('res1: ',res1)

res1:  ['John', None, 'Michael', 'Sarah', 'David', 'Emily']

##### B. Find the department of employee with ID 4

In [43]:
#Answer:
filter(lambda emp: emp['name'] == 'John', data)

##### C. Count the number of employees in each department

In [15]:
#Answer:

##### D. Find the names of employees in the "Engineering" department

In [16]:
#Answer:

##### E. Extract names of employees with skills including "Programming"

In [17]:
#Answer:

##### F. Calculate the average number of skills per employee

In [18]:
#Answer:

##### G. Find the employee with the most skills

In [19]:
#Answer: